app/controllers/webinars_controller.rb

  def index
    @webinar = Webinar.order(created_at: :desc).limit(6)
---
SELECT `webinars`.* FROM `webinars` ORDER BY `webinars`.`created_at` DESC

  def show
    @webinar1 = Webinar.all
    @webinar2 = @webinar1.sample(3)

    @webinar = Webinar.friendly.find(params[:id])
---
SELECT MAX(3) FROM `webinars`
SELECT `webinars`.* FROM `webinars`
SELECT  `webinars`.* FROM `webinars` WHERE `webinars`.`id` = 2 LIMIT 1

  def create
    @thread = Webinar.new(resource_params)
    @thread.user = current_user
    @thread.save
---
INSERT INTO `webinars` (`title`, `speaker`, `date`, `image`, `embed`, `user_id`, `created_at`, `updated_at`, `slug`) VALUES ('If You\'ve Got the Time, We\'ve Got the Webinar.', 'Satriyo Unggul Wicaksono', '2018-05-17', '', '', 1, '2018-05-09 10:31:56', '2018-05-09 10:31:56', 'if-you-ve-got-the-time-we-ve-got-the-webinar')

  def update
    @webinar = Webinar.friendly.find(params[:id])
    @webinar.update(resource_params)
---
SELECT  `webinars`.* FROM `webinars` WHERE `webinars`.`id` = 0 LIMIT 1
UPDATE `webinars` SET `about` = '<p>Woodruff has a degree in computer science from Michigan State University&#39;s College of Engineering. Woody has been developing and architecting software solutions for over 20 years and has worked in many different platforms and tools.</p>\r\n\r\n<p>He is a community leader, helping such events as GRDevNight and GR DevDay. As a speaker and podcaster, Woody has spoken and discussed a variety of topics from database design to open source. He was a Microsoft MVP in Visual C# and Data Platform and SQL from 2009 to 2014 and was recognized in 2010 as one of the top 20 MVPs worldwide.</p>\r\n', `image` = '/uploads/ckeditor/pictures/1/content_blog-2.jpg', `updated_at` = '2018-05-11 06:28:40' WHERE `webinars`.`id` = 15

  def destroy
    @webinar = Webinar.friendly.find(params[:id])
    @webinar.destroy
---
DELETE FROM `webinars` WHERE `webinars`.`id` = 1

  def all
    @webinar = Webinar.all
---
SELECT `webinars`.* FROM `webinars`